### Esse notebook irá mostrar como converter um  JSON em um DataFrame utilizando a biblioteca pandas.

#### 1. Importação das bibliotecas que serão utilizadas

In [44]:
import pandas as pd
import json
from pandas import json_normalize

In [45]:
arquivo_json_exemplo_1 = open('exemplo1.json','r') 
arquivo_json_exemplo_2 = open('exemplo2.json','r')

In [46]:
dados_1 = json.loads(arquivo_json_exemplo_1.read())
dados_2 = json.loads(arquivo_json_exemplo_2.read())

In [47]:
dados_1

{'nome': 'Universidade de natal',
 'curso': 'Engenharia de Computacao',
 'infor': {'coordenador': 'Jose da Silva',
  'endereco': 'Avenida Senador Salgado Filho',
  'contato': {'email': 'jose@hotmail.com', 'tel': '123456789'}},
 'estudantes': [{'id': 'A001',
   'nome': 'Joao',
   'idade': 20,
   'email': 'joao@gmail.com',
   'notas': {'matematica': 79, 'fisica': 90, 'quimica': 78}},
  {'id': 'A002',
   'nome': 'Pedro',
   'idade': 24,
   'email': 'pedro@gmail.com',
   'notas': {'matematica': 75, 'fisica': 50, 'quimica': 25}},
  {'id': 'A003',
   'nome': 'Maira',
   'idade': 23,
   'email': 'Maira@gmail.com',
   'notas': {'matematica': 25, 'fisica': 55, 'quimica': 15}}]}

In [48]:
dados_2

{'nome': 'Universidade de natal',
 'curso': 'Engenharia Mecatronica',
 'infor': {'coordenador': 'Maria da Silva',
  'endereco': 'Avenida Bernado Vieira',
  'contato': {'email': 'maria@hotmail.com', 'tel': '987654321'}},
 'estudantes': [{'id': 'A004',
   'nome': 'Lais',
   'idade': 19,
   'email': 'lais@gmail.com',
   'notas': {'matematica': 10, 'fisica': 100, 'quimica': 100}},
  {'id': 'A005',
   'nome': 'thiago',
   'idade': 28,
   'email': 'thiago@gmail.com',
   'notas': {'matematica': 10, 'fisica': 88, 'quimica': 95}},
  {'id': 'A006',
   'nome': 'May',
   'idade': 18,
   'email': 'May@gmail.com',
   'notas': {'matematica': 100, 'fisica': 100, 'quimica': 100}}]}

In [49]:
df_1 =  pd.json_normalize(dados_1, record_path =['estudantes'], meta=['curso', ['infor', 'coordenador'], 
        ['infor', 'contato', 'email'], ['infor', 'contato', 'tel']])

In [50]:
df_1

,id,nome,idade,email,notas.matematica,notas.fisica,notas.quimica,curso,infor.coordenador,infor.contato.email,infor.contato.tel
0,A001,Joao,20,joao@gmail.com,79,90,78,Engenharia de Computacao,Jose da Silva,jose@hotmail.com,123456789
1,A002,Pedro,24,pedro@gmail.com,75,50,25,Engenharia de Computacao,Jose da Silva,jose@hotmail.com,123456789
2,A003,Maira,23,Maira@gmail.com,25,55,15,Engenharia de Computacao,Jose da Silva,jose@hotmail.com,123456789

In [51]:
df_2 =  pd.json_normalize(dados_2, record_path =['estudantes'], meta=['curso', ['infor', 'coordenador'], 
        ['infor', 'contato', 'email'], ['infor', 'contato', 'tel']])

In [52]:
df_2

,id,nome,idade,email,notas.matematica,notas.fisica,notas.quimica,curso,infor.coordenador,infor.contato.email,infor.contato.tel
0,A004,Lais,19,lais@gmail.com,10,100,100,Engenharia Mecatronica,Maria da Silva,maria@hotmail.com,987654321
1,A005,thiago,28,thiago@gmail.com,10,88,95,Engenharia Mecatronica,Maria da Silva,maria@hotmail.com,987654321
2,A006,May,18,May@gmail.com,100,100,100,Engenharia Mecatronica,Maria da Silva,maria@hotmail.com,987654321

In [53]:
df_concat = pd.concat([df_1, df_2], ignore_index=True, join='inner' )

In [54]:
df_concat

,id,nome,idade,email,notas.matematica,notas.fisica,notas.quimica,curso,infor.coordenador,infor.contato.email,infor.contato.tel
0,A001,Joao,20,joao@gmail.com,79,90,78,Engenharia de Computacao,Jose da Silva,jose@hotmail.com,123456789
1,A002,Pedro,24,pedro@gmail.com,75,50,25,Engenharia de Computacao,Jose da Silva,jose@hotmail.com,123456789
2,A003,Maira,23,Maira@gmail.com,25,55,15,Engenharia de Computacao,Jose da Silva,jose@hotmail.com,123456789
3,A004,Lais,19,lais@gmail.com,10,100,100,Engenharia Mecatronica,Maria da Silva,maria@hotmail.com,987654321
4,A005,thiago,28,thiago@gmail.com,10,88,95,Engenharia Mecatronica,Maria da Silva,maria@hotmail.com,987654321
5,A006,May,18,May@gmail.com,100,100,100,Engenharia Mecatronica,Maria da Silva,maria@hotmail.com,987654321

In [55]:
df_concat.rename(columns={'notas.matematica': 'nota_matematica', 'notas.fisica': 'nota_fisica', 'notas.quimica': 'nota_quimica', 'infor.coordenador': 'coordenador_curso', 'infor.contato.email': 'coordenador_email','infor.contato.tel': 'coordenador_tel'} , inplace = True)

In [56]:
df_concat

,id,nome,idade,email,nota_matematica,nota_fisica,nota_quimica,curso,coordenador_curso,coordenador_email,coordenador_tel
0,A001,Joao,20,joao@gmail.com,79,90,78,Engenharia de Computacao,Jose da Silva,jose@hotmail.com,123456789
1,A002,Pedro,24,pedro@gmail.com,75,50,25,Engenharia de Computacao,Jose da Silva,jose@hotmail.com,123456789
2,A003,Maira,23,Maira@gmail.com,25,55,15,Engenharia de Computacao,Jose da Silva,jose@hotmail.com,123456789
3,A004,Lais,19,lais@gmail.com,10,100,100,Engenharia Mecatronica,Maria da Silva,maria@hotmail.com,987654321
4,A005,thiago,28,thiago@gmail.com,10,88,95,Engenharia Mecatronica,Maria da Silva,maria@hotmail.com,987654321
5,A006,May,18,May@gmail.com,100,100,100,Engenharia Mecatronica,Maria da Silva,maria@hotmail.com,987654321